posts/what-to-migrate.org
#+BEGIN_COMMENT
.. title: what to migrate
.. slug: what-to-migrate
.. date: 2022-05-13 15:10:22 UTC+02:00
.. tags: organisation, bePrepared
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

So every day I am more close to a perfect set up on my local machine.

The question is then how to make sure that you have a smooth
transition in case you change your laptop.

Sooner or later this will happen and I do not want to loose too much
time setting everything up properly again.

{{{TEASER_END}}}

So basically this is a list of things you will have to migrate when
there will be the moment.

Generally I like to keep everything into One-drive and from the onset
I worked personally by putting all of my repositories in there such
that this will be already organized out of the box.

Also all of the software that I manually installed is on one drive so
that should be fine as well.

Nonetheless there are a given set of things that are configured by
default to run in given places.

These are listed in here so that you do not forget to migrate them

- =c:/Users/marco.hassan/.ssh/=:

  here you have your set of public-private keys in order to properly
  and securely transfer of data over the internet.

- =c:/Users/marco.hassan/.gradle/gradle.properties=:

  here you have a few parameters that you use in your gradle in order
  to properly build and package your applications. 

- =c:/Users/marco.hassan/AppData/Roaming/=

  here you have couple of programs - your =.emacs.d= brain as well
  MicTex, jupyter and other stuff together with the =.emacs= file that
  calls your emacs configuration org file.

  So this is of paramount importance

- =c:/Dev/=

  Here you have both your java Workspace as well as your python one.

  Everything is pretty much version controled so should be no issue.

  Just recall to bring it with you to have a further guarantee.

- =c:/JavaServer/=

  Here you have your programs with all of the relevant servers.

  Bring it with you, will be quite useful in order to work with all of
  the non-spring applications. 

  



