cache/posts/what-to-migrate.html
<p>
So every day I am more close to a perfect set up on my local machine.
</p>

<p>
The question is then how to make sure that you have a smooth
transition in case you change your laptop.
</p>

<p>
Sooner or later this will happen and I do not want to loose too much
time setting everything up properly again.
</p>

<!-- TEASER_END -->

<p>
So basically this is a list of things you will have to migrate when
there will be the moment.
</p>

<p>
Generally I like to keep everything into One-drive and from the onset
I worked personally by putting all of my repositories in there such
that this will be already organized out of the box.
</p>

<p>
Also all of the software that I manually installed is on one drive so
that should be fine as well.
</p>

<p>
Nonetheless there are a given set of things that are configured by
default to run in given places.
</p>

<p>
These are listed in here so that you do not forget to migrate them
</p>

<ul class="org-ul">
<li><p>
<code>c:/Users/marco.hassan/.ssh/</code>:
</p>

<p>
here you have your set of public-private keys in order to properly
and securely transfer of data over the internet.
</p></li>

<li><p>
<code>c:/Users/marco.hassan/AppData/Roaming/</code>
</p>

<p>
here you have couple of programs - your <code>.emacs.d</code> brain as well
MicTex, jupyter and other stuff together with the <code>.emacs</code> file that
calls your emacs configuration org file.
</p>

<p>
So this is of paramount importance
</p></li>

<li><p>
<code>c:/Dev/</code>
</p>

<p>
Here you have both your java Workspace as well as your python one.
</p>

<p>
Everything is pretty much version controled so should be no issue.
</p>

<p>
Just recall to bring it with you to have a further guarantee.
</p></li>

<li><p>
<code>c:/JavaServer/</code>
</p>

<p>
Here you have your programs with all of the relevant servers.
</p>

<p>
Bring it with you, will be quite useful in order to work with all of
the non-spring applications. 
</p></li>
</ul>
